RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_filter.c
/***************************************************************************//**
* \file cy_capsense_filter.c
* \version 3.0
*
* \brief
* This file contains the source code of all filters implementation.
*
********************************************************************************
* \copyright
* Copyright 2018-2021, Cypress Semiconductor Corporation (an Infineon company)
* or an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include <stddef.h>
#include "cycfg_capsense_defines.h"
#include "cy_capsense_filter.h"
#include "cy_capsense_common.h"
#include "cy_capsense_lib.h"

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3))


/*******************************************************************************
* Local definition
*******************************************************************************/
#define CY_CAPSENSE_IIR_BL_SHIFT                                (8u)

#define CY_CAPSENSE_IIR_SHIFT_STANDARD                          (0u)
#define CY_CAPSENSE_IIR_SHIFT_PERFORMANCE                       (8u)

#define CY_CAPSENSE_RC_MEDIAN_SIZE                              (2u)
#define CY_CAPSENSE_RC_IIR_SIZE                                 (1u)
#define CY_CAPSENSE_RC_AVG_SIZE                                 (3u)

/* IIR filter constant */
#define CY_CAPSENSE_IIR_COEFFICIENT_K                           (256u)

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

static cy_capsense_status_t Cy_CapSense_CheckBaselineInv(
                cy_stc_capsense_widget_context_t * ptrWdContext,
                const cy_stc_capsense_sensor_context_t * ptrSnsContext,
                const uint16_t * ptrSnsBslnInv,
                const cy_stc_capsense_context_t * context);

/** \} \endcond */


/*******************************************************************************
* Function Name: Cy_CapSense_UpdateAllBaselines
****************************************************************************//**
*
* Updates the baseline for all the sensors in all the widgets. 
* 
* Baselines must be updated after sensor scan to ignore low frequency 
* changes in the sensor data caused by environment changes such as 
* temperature from sensor status decision. 
* 
* This function ignores the widget enable bit in the widget status register.
* Calling this function multiple times without a new sensor scan leads to 
* unexpected behavior and should be avoided. 
* 
* This function is called by Cy_CapSense_ProcessAllWidgets() and 
* Cy_CapSense_ProcessWidget(), hence the application program need not use this  
* function if any of the above functions is already used. This function can be 
* used for custom application implementation.
* 
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the update baseline operation of all the widgets:
* - CY_CAPSENSE_STATUS_SUCCESS  - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_DATA - The baseline processing failed.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_UpdateAllBaselines(
                const cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    cy_capsense_status_t bslnStatus = CY_CAPSENSE_STATUS_SUCCESS;

    for(wdIndex = context->ptrCommonConfig->numWd; wdIndex-- > 0u;)
    {
        bslnStatus |= Cy_CapSense_UpdateWidgetBaseline(wdIndex, context);
    }

    return(bslnStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_UpdateWidgetBaseline
****************************************************************************//**
*
* Updates the baselines for all the sensors in a widget specified by 
* the input parameter. 
* 
* This function performs exactly the same tasks as 
* Cy_CapSense_UpdateAllBaselines() but only for a specified widget.
* 
* Calling this function multiple times without a new sensor scan leads to 
* unexpected behavior and should be avoided. The application program need 
* not use this function if the Cy_CapSense_UpdateAllBaselines(), 
* Cy_CapSense_ProcessAllWidgets() or Cy_CapSense_ProcessWidget() functions 
* are already used.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found 
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget update baseline operation:
* - CY_CAPSENSE_STATUS_SUCCESS - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_DATA - The baseline processing failed.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_UpdateWidgetBaseline(
                uint32_t widgetId, 
                const cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    cy_capsense_status_t bslnStatus = CY_CAPSENSE_STATUS_SUCCESS;

    for(snsIndex = context->ptrWdConfig[widgetId].numSns; snsIndex-- > 0u;)
    {
        bslnStatus |= Cy_CapSense_UpdateSensorBaseline(widgetId, snsIndex, context);
    }

    return(bslnStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_UpdateSensorBaseline
****************************************************************************//**
*
* Updates the baseline for a sensor in a widget specified by the 
* input parameters. 
* 
* This function performs exactly the same tasks as 
* Cy_CapSense_UpdateAllBaselines() and Cy_CapSense_UpdateWidgetBaseline() 
* but only for a specified sensor.
* 
* Calling this function multiple times without a new sensor scan leads to 
* unexpected behavior and should be avoided. The application need not use 
* this function if the Cy_CapSense_UpdateWidgetBaseline (), 
* Cy_CapSense_UpdateAllBaselines (), Cy_CapSense_ProcessAllWidgets(), 
* or Cy_CapSense_ProcessWidget() functions are already used.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found 
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget. A macro for the 
* sensor ID within a specified widget can be found in the cycfg_capsense.h 
* file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified sensor update baseline operation:
* - CY_CAPSENSE_STATUS_SUCCESS - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_DATA - The baseline processing failed.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_UpdateSensorBaseline(
                uint32_t widgetId, 
                uint32_t sensorId, 
                const cy_stc_capsense_context_t * context)
{
    uint32_t result;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = &ptrWdCfg->ptrSnsContext[sensorId];

    result = Cy_CapSense_FtUpdateBaseline(ptrWdCfg->ptrWdContext, ptrSnsCxt, &ptrWdCfg->ptrBslnInv[sensorId], context);

    return (result);
}


