RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_filter.c
/*******************************************************************************
* Function Name: Cy_CapSense_CheckBaselineInv
****************************************************************************//**
*
* Check a matching of present baseline and its inverse duplication.
*
* \param ptrWdContext
* The pointer to the widget context structure where all the widget parameters
* are stored.
*
* \param ptrSnsContext
* The pointer to the sensor context structure where the sensor data
* is stored.
*
* \param ptrSnsBslnInv
* The pointer to the sensor baseline inversion used for BIST if enabled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status indicating check result:
* - CY_CAPSENSE_STATUS_SUCCESS -  if the BIST baseline integrity test is enabled and
*                                 baseline and its inverse duplication match or BIST
*                                 baseline integrity test is disabled.
* - CY_CAPSENSE_STATUS_BAD_DATA - if the BIST baseline integrity test is enabled and
*                                 the sensor's baseline and its inversion doesn't
*                                 match. In this case the function as well clears
*                                 the bit[2] (Widget Working) of the .status field
*                                 in the widget context structure preventing corrupted
*                                 data usage and set the CY_CAPSENSE_BIST_BSLN_INTEGRITY_MASK
*                                 bit of the .testResultMask field
*                                 in the /ref cy_stc_capsense_bist_context_t structure.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_CheckBaselineInv(
                cy_stc_capsense_widget_context_t * ptrWdContext,
                const cy_stc_capsense_sensor_context_t * ptrSnsContext,
                const uint16_t * ptrSnsBslnInv,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_SUCCESS;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN))
        uint16_t bslnInv = (uint16_t)(~ptrSnsContext->bsln);

        if (*ptrSnsBslnInv != bslnInv)
        {
            result = CY_CAPSENSE_STATUS_BAD_DATA;
            ptrWdContext->status &= (uint8_t)~CY_CAPSENSE_WD_WORKING_MASK;
            context->ptrBistContext->testResultMask |= CY_CAPSENSE_BIST_BSLN_INTEGRITY_MASK;
        }
    #else
        (void) ptrWdContext;
        (void) ptrSnsContext;
        (void) ptrSnsBslnInv;
        (void) context;
    #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
               (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN)) */

    return result;
}

/*******************************************************************************
* Function Name: Cy_CapSense_FtUpdateBaseline
****************************************************************************//**
*
* Updates the baseline for a sensor specified by an input parameter.
*
* Check a matching of present baseline and its inverse duplication. If they
* match, then the function updates the baseline for a sensor specified by an input parameter.
* If they don't match, the function returns CY_CAPSENSE_TST_BSLN_DUPLICATION
* result and doesn't update the baseline.
*
* \param ptrWdContext
* The pointer to the widget context structure where all the widget parameters
* are stored.
*
* \param ptrSnsContext
* The pointer to the sensor context structure where the sensor data
* is stored.
*
* \param ptrSnsBslnInv
* The pointer to the sensor baseline inversion used for BIST if enabled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status indicating whether the baseline has been updated:
* - CY_CAPSENSE_STATUS_SUCCESS - if baseline updating was successful.
* - CY_CAPSENSE_STATUS_BAD_DATA - if the BIST baseline integrity test is enabled and
*                                 the sensor's baseline and its inversion doesn't
*                                 match. In this case the function as well clears
*                                 the bit[2] (Widget Working) of the .status field
*                                 in the widget context structure preventing corrupted
*                                 data usage and set the CY_CAPSENSE_BIST_BSLN_INTEGRITY_MASK
*                                 bit of the .testResultMask field
*                                 in the /ref cy_stc_capsense_bist_context_t structure.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_FtUpdateBaseline(
                cy_stc_capsense_widget_context_t * ptrWdContext,
                cy_stc_capsense_sensor_context_t * ptrSnsContext,
                uint16_t * ptrSnsBslnInv,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result;
    uint32_t bslnHistory;

    result = Cy_CapSense_CheckBaselineInv(ptrWdContext, ptrSnsContext, ptrSnsBslnInv, context);

    if (CY_CAPSENSE_STATUS_SUCCESS == result)
    {
        /* Reset negative baseline counter */
        if(ptrSnsContext->raw >= ptrSnsContext->bsln)
        {
            ptrSnsContext->negBslnRstCnt = 0u;
        }

        /* Reset baseline */
        if ((uint32_t)ptrSnsContext->bsln > ((uint32_t)ptrWdContext->nNoiseTh + ptrSnsContext->raw))
        {
            if (ptrSnsContext->negBslnRstCnt >= ptrWdContext->lowBslnRst)
            {
                Cy_CapSense_FtInitializeBaseline(ptrSnsContext);
            }
            else
            {
                ptrSnsContext->negBslnRstCnt++;
            }
        }
        else
        {
            /*
            * Update baseline only if:
            * - signal is in range between noiseThreshold and negativenoiseThreshold
            * or
            * - sensor Auto-reset is enabled
            */
            if ((0u != context->ptrCommonConfig->swSensorAutoResetEn) ||
                ((uint32_t)ptrSnsContext->raw <= ((uint32_t)ptrWdContext->noiseTh + ptrSnsContext->bsln)))
            {
                /* Get real baseline */
                bslnHistory = ((uint32_t)ptrSnsContext->bsln << CY_CAPSENSE_IIR_BL_SHIFT) | ptrSnsContext->bslnExt;
                /* Calculate baseline value */
                bslnHistory = Cy_CapSense_FtIIR1stOrder((uint32_t)ptrSnsContext->raw << CY_CAPSENSE_IIR_BL_SHIFT, bslnHistory, (uint32_t)ptrWdContext->bslnCoeff);
                /* Split baseline */
                ptrSnsContext->bsln = (uint16_t)(bslnHistory >> CY_CAPSENSE_IIR_BL_SHIFT);
                ptrSnsContext->bslnExt = (uint8_t)(bslnHistory);
            }
        }
        /* If BIST enabled, update the baseline inverse duplication */
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN))
            *ptrSnsBslnInv = ~ptrSnsContext->bsln;
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN)) */
    }
    return result;
}


