RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_filter.c
/*******************************************************************************
* Function Name: Cy_CapSense_InitializeAllBaselines
****************************************************************************//**
*
* Initializes the baselines of all the sensors of all the widgets.
* 
* This function initializes baselines for all sensors and widgets in the project. 
* It can also be used to re-initialize baselines at any time, however, note 
* that all sensor data history information and sensor status shall be reset 
* along with re-initialization of baseline.
* 
* Following functions to initialize sensor and widgets and filter history 
* should be called after initializing baseline for proper operation of 
* the CAPSENSE&trade; middleware:
* * Cy_CapSense_InitializeAllStatuses()
* * Cy_CapSense_InitializeAllFilters()
* 
* These functions are called by the CapSense_Enable() function, hence it is 
* not required to use this function if above function is used.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeAllBaselines(cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;

    for(wdIndex = context->ptrCommonConfig->numWd; wdIndex-- > 0u;)
    {
        Cy_CapSense_InitializeWidgetBaseline(wdIndex, context);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeWidgetBaseline
****************************************************************************//**
*
* Initializes the baselines of all the sensors in a specific widget. 
* 
* This function initializes baselines for all sensors in a specific widget 
* in the project. It can also be used to re-initialize baselines at any time, 
* however, note that all sensor data history information and sensor status 
* should be reset along with re-initialization of baseline.
* 
* The following functions to initialize sensor and widgets and filter history 
* should be called after initializing baselines for proper operation of 
* middleware.
* * Cy_CapSense_InitializeWidgetStatus()
* * Cy_CapSense_InitializeWidgetFilter()
* 
* These functions are called by CapSense_Enable() function, hence it is not 
* required to use this function is above function is used.
* 
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found 
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeWidgetBaseline(
                uint32_t widgetId, 
                cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;

    for(snsIndex = context->ptrWdConfig[widgetId].numSns; snsIndex-- > 0u;)
    {
        Cy_CapSense_InitializeSensorBaseline(widgetId, snsIndex, context);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeSensorBaseline
****************************************************************************//**
*
* Initializes the baseline of a sensor in a widget specified
* by the input parameters.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found 
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget. A macro for the 
* sensor ID within a specified widget can be found in the cycfg_capsense.h 
* file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeSensorBaseline(
                uint32_t widgetId, 
                uint32_t sensorId, 
                cy_stc_capsense_context_t * context)
{
    uint32_t cxtOffset;
    uint32_t freqChIndex;
    for(freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
    {
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
            cxtOffset = sensorId + (freqChIndex * context->ptrCommonConfig->numSns);
        #else
            cxtOffset = sensorId;
        #endif
        Cy_CapSense_FtInitializeBaseline(&context->ptrWdConfig[widgetId].ptrSnsContext[cxtOffset]);
        /* If BIST enabled, create a baseline inverse duplication */
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN))
            context->ptrWdConfig[widgetId].ptrBslnInv[cxtOffset] =
                                            ~context->ptrWdConfig[widgetId].ptrSnsContext[cxtOffset].bsln;
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN)) */
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_FtInitializeBaseline
****************************************************************************//**
*
* Initializes the baseline history for a sensor indicated by an input
* parameter.
*
* \param ptrSnsContext 
* The pointer to the sensor context structure.
*
*******************************************************************************/
void Cy_CapSense_FtInitializeBaseline(cy_stc_capsense_sensor_context_t * ptrSnsContext)
{
    ptrSnsContext->bslnExt = 0u;
    ptrSnsContext->bsln = ptrSnsContext->raw;
    ptrSnsContext->negBslnRstCnt = 0u;
}

#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_RAWCOUNT_FILTER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_InitializeAllFilters
****************************************************************************//**
*
* Initializes (or re-initializes) all the firmware filter history, except 
* the baseline.
*
* Calling this function is accompanied by 
* * Cy_CapSense_InitializeAllStatuses()
* * Cy_CapSense_InitializeAllBaselines()
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InitializeAllFilters(const cy_stc_capsense_context_t * context)
{
    uint32_t widgetId;

